##############################超轻量版：自适应通道P1+P2######################
# Parameters
nc: 80
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# P1+P2 Ultra-Lightweight: Adaptive channels
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, EGConv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f_gConv, [128, True]] # 2-P2/4 feature

  - [-1, 1, EGConv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, GhostC2f, [256, True]] # 4-P3/8 feature
  - [-1, 1, SAGE, [8, 0.7]] # 5-P3/8 attention

  - [-1, 1, EGConv, [512, 3, 2]] # 6-P4/16
  - [-1, 6, GhostC2f, [512, True]] # 7-P4/16 feature

  - [-1, 1, EGConv, [1024, 3, 2]] # 8-P5/32
  - [-1, 3, C2f_gConv, [1024, True]] # 9-P5/32 feature
  - [-1, 1, SPPF, [1024, 5]] # 10-P5/32 enhanced

head:
  # ============ FPN 上采样路径 ============
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11: P5→P4
  - [[-1, 7], 1, Concat, [1]] # 12: cat backbone P4
  - [-1, 3, C2f_gConv, [512]] # 13: P4/16 fused

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14: P4→P3
  - [[-1, 5], 1, Concat, [1]] # 15: cat backbone P3
  - [-1, 3, C2f_gConv, [256]] # 16: P3/8 fused

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 17: P3→P2
  - [[-1, 2], 1, Concat, [1]] # 18: cat backbone P2
  - [-1, 3, C2f_gConv, [128]] # 19: P2/4 fused

  # ============ P1轻量分支（32通道）============
  - [0, 1, Conv, [32, 1, 1]] # 20: P1 ultra-light (64→32)
  - [-1, 1, EGConv, [32, 3, 2]] # 21: P1→P2 scale
  - [-1, 1, EGConv, [32, 3, 2]] # 22: P1→P3 scale

  # ============ P2轻量分支（96通道）============
  - [2, 1, Conv, [96, 1, 1]] # 23: P2 reduced (128→96)
  - [-1, 1, EGConv, [96, 3, 2]] # 24: P2→P3 scale
  - [-1, 1, EGConv, [96, 3, 2]] # 25: P2→P4 scale
  - [-1, 1, EGConv, [96, 3, 2]] # 26: P2→P5 scale

  # ============ PAN 自适应注入 ============

  # Stage 1: P3融合 (P1+P2，轻量通道)
  - [19, 1, EGConv, [128, 3, 2]] # 27: FPN-P2 downsample
  - [[-1, 16, 22, 24], 1, Concat, [1]] # 28: cat(PAN-P2, FPN-P3, P1, P2) [128+256+32+96=512]
  - [-1, 3, C2f_gConv, [256]] # 29: P3/8 final

  # Stage 2: P4融合 (仅P2)
  - [-1, 1, EGConv, [256, 3, 2]] # 30: P3→P4 downsample
  - [[-1, 13, 25], 1, Concat, [1]] # 31: cat(PAN-P3, FPN-P4, P2) [256+512+96=864]
  - [-1, 3, C2f_gConv, [512]] # 32: P4/16 final

  # Stage 3: P5融合 (仅P2)
  - [-1, 1, EGConv, [512, 3, 2]] # 33: P4→P5 downsample
  - [[-1, 10, 26], 1, Concat, [1]] # 34: cat(PAN-P4, FPN-P5, P2) [512+1024+96=1632]
  - [-1, 3, C2f_gConv, [1024]] # 35: P5/32 final

  # ============ Detect Head ============
  - [[19, 29, 32, 35], 1, Detect_DyHead, [nc, 128, 1]] # 36: Detect
##############################超轻量版：自适应通道P1+P2######################

#Visdrone
#Ultralytics YOLOv8.2.50 🚀 Python-3.11.10 torch-2.4.0+cu121 CUDA:0 (NVIDIA GeForce RTX 4090, 48646MiB)
#YOLOv81015_P1+P2_in summary (fused): 364 layers, 3323800 parameters, 0 gradients, 19.6 GFLOPs
#                 Class     Images  Instances      Box(P          R      mAP50  mAP50-95): 100%|██████████| 28/28 [00:14<00:00,  1.99it/s]
#                   all        548      38759      0.512      0.404      0.416      0.248
#            pedestrian        520       8844       0.56       0.44      0.477      0.226
#                people        482       5125      0.534       0.37      0.394      0.161
#               bicycle        364       1287      0.316      0.185       0.16     0.0721
#                   car        515      14064      0.691      0.819      0.828      0.589
#                   van        421       1975      0.518      0.472      0.476      0.337
#                 truck        266        750      0.509       0.34      0.349      0.227
#              tricycle        337       1045      0.484      0.256      0.276      0.156
#       awning-tricycle        220        532      0.335      0.186      0.166      0.103
#                   bus        131        251      0.599      0.486      0.536      0.381
#                 motor        485       4886       0.57      0.484        0.5      0.231
#Speed: 0.1ms preprocess, 4.1ms inference, 0.0ms loss, 8.7ms postprocess per image
#Results saved to runs/train/exp_EGConv_Vis_P1+P2_In

#Hit-uav
#Validating runs/train/exp_EGConv_Hit_P1+P2_In_300_GhostC2f/weights/best.pt...
#Ultralytics YOLOv8.2.50 🚀 Python-3.11.10 torch-2.4.0+cu121 CUDA:0 (NVIDIA GeForce RTX 4090, 48646MiB)
#YOLOv81015_P1+P2_in summary: 446 layers, 2492780 parameters, 0 gradients, 17.1 GFLOPs
#                 Class     Images  Instances      Box(P          R      mAP50  mAP50-95): 100%|██████████| 15/15 [00:03<00:00,  4.12it/s]
#                   all        287       2453      0.912      0.899      0.945      0.615
#                Person        171       1168      0.898       0.89      0.928      0.538
#                   Car        139        731      0.956      0.944       0.98      0.758
#               Bicycle         53        554      0.882      0.862      0.925      0.551
#Speed: 0.1ms preprocess, 9.1ms inference, 0.0ms loss, 0.6ms postprocess per image
#Results saved to runs/train/exp_EGConv_Hit_P1+P2_In_300_GhostC2f
#进程已结束,退出代码-1

