# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 + SimFormer (P2 & P3) 增强版

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8 backbone with SimFormer at P2 and P3
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]           # 0-P1/2 (320×320)

  - [-1, 1, EGConv, [128, 3, 2]]     # 1-P2/4 (160×160)
  - [-1, 3, C2f_gConv, [128, True]]     # 2-P2/4 feature
  - [-1, 1, SAGE, [8, 0.7]]        # 3-P2/4 attention

  - [-1, 1, EGConv, [256, 3, 2]]     # 4-P3/8 (80×80)
  - [-1, 6, C2f_gConv, [256, True]]     # 5-P3/8 feature
  - [-1, 1, SAGE, [4, 0.5]]        # 6-P3/8 attention

  - [-1, 1, Conv, [512, 3, 2]]     # 7-P4/16 (40×40)
  - [-1, 6, C2f_gConv, [512, True]]     # 8-P4/16 feature

  - [-1, 1, Conv, [1024, 3, 2]]    # 9-P5/32 (20×20)
  - [-1, 3, C2f_gConv, [1024, True]]    # 10-P5/32 feature
  - [-1, 1, SPPF, [1024, 5]]            # 11-P5/32 enhanced

# YOLOv8 head
head:
  # FPN 上采样路径
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 12: P5→P4 (40×40)
  - [[-1, 8], 1, Concat, [1]]                   # 13: cat backbone P4
  - [-1, 3, C2f_gConv, [512]]                   # 14: P4/16 fused

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 15: P4→P3 (80×80)
  - [[-1, 6], 1, PixelAttentionFusion, [512, 256]]                   # 16: cat backbone P3 (with SimFormer)
  - [-1, 3, C2f_gConv, [256]]                   # 17: P3/8 fused

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 18: P3→P2 (160×160)
  - [[-1, 3], 1, DynamicPixelFusion, [256, 128]]                   # 19: cat backbone P2 (with SimFormer)
  - [-1, 3, C2f_gConv, [128]]                   # 20: P2/4 fused

  # PAN 下采样路径
  - [-1, 1, GhostConv, [128, 3, 2]]             # 21: P2→P3 (80×80)
  - [[-1, 17], 1, Concat, [1]]                  # 22: cat head P3
  - [-1, 3, C2f_gConv, [256]]                   # 23: P3/8 final

  - [-1, 1, GhostConv, [256, 3, 2]]             # 24: P3→P4 (40×40)
  - [[-1, 14], 1, Concat, [1]]                  # 25: cat head P4
  - [-1, 3, C2f_gConv, [512]]                   # 26: P4/16 final

  - [-1, 1, GhostConv, [512, 3, 2]]             # 27: P4→P5 (20×20)
  - [[-1, 11], 1, Concat, [1]]                  # 28: cat head P5 (SPPF output)
  - [-1, 3, C2f_gConv, [1024]]                  # 29: P5/32 final

  # Detect head (P2, P3, P4, P5)
  - [[20, 23, 26, 29], 1, Detect_DyHead, [nc, 128, 1]]         # 30: Detect