# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8 backbone with SimFormer at P3 only
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]           # 0-P1/2 (320×320)
  - [-1, 1, EGConv, [128, 3, 2]]        # 1-P2/4 (160×160)
  - [-1, 3, C2f, [128, True]]           # 2-P2/4 feature 主要P2特征源

  - [-1, 1, EGConv, [256, 3, 2]]        # 3-P3/8 (80×80)
  - [-1, 6, C2f, [256, True]]           # 4-P3/8 feature
  - [-1, 1, SAGE, [8, 0.7]]             # 5-P3/8 attention

  - [-1, 1, EGConv, [512, 3, 2]]        # 6-P4/16 (40×40)
  - [-1, 6, C2f, [512, True]]           # 7-P4/16 feature

  - [-1, 1, EGConv, [1024, 3, 2]]       # 8-P5/32 (20×20)
  - [-1, 3, C2f, [1024, True]]          # 9-P5/32 feature
  - [-1, 1, SPPF, [1024, 5]]            # 10-P5/32 enhanced

# YOLOv8 head with PRN-style Progressive P2 Injection
head:
  # ============ FPN 上采样路径 ============
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 11: P5→P4 (40×40)
  - [[-1, 7], 1, Concat, [1]]                   # 12: cat backbone P4
  - [-1, 3, C2f, [512]]                         # 13: P4/16 fused

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 14: P4→P3 (80×80)
  - [[-1, 5], 1, Concat, [1]]                   # 15: cat backbone P3 (with SAGE)
  - [-1, 3, C2f, [256]]                         # 16: P3/8 fused

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 17: P3→P2 (160×160)
  - [[-1, 2], 1, Concat, [1]]                   # 18: cat backbone P2
  - [-1, 3, C2f, [128]]                         # 19: P2/4 fused

  # ============ P2下采样分支（为后续注入准备）============
  - [2, 1, Conv, [128, 1, 1]]                   # 20: P2 enhanced (1x1卷积增强)
  - [-1, 1, EGConv, [128, 3, 2]]                # 21: P2→P3 scale (80×80)
  - [-1, 1, EGConv, [128, 3, 2]]                # 22: P2→P4 scale (40×40)
  - [-1, 1, EGConv, [128, 3, 2]]                # 23: P2→P5 scale (20×20)

  # ============ PAN 下采样路径 + 渐进式P2注入 ============

  # Stage 1: P2→P3 融合 (PRN第1次注入)
  - [19, 1, EGConv, [128, 3, 2]]                # 24: FPN-P2 downsample (80×80)
  - [[-1, 16, 21], 1, Concat, [1]]              # 25: cat(PAN-P2, FPN-P3, Enhanced-P2)
  - [-1, 3, C2f, [256]]                         # 26: P3/8 final (第一次P2注入)

  # Stage 2: P3→P4 融合 (PRN第2次注入)
  - [-1, 1, EGConv, [256, 3, 2]]                # 27: P3→P4 downsample (40×40)
  - [[-1, 13, 22], 1, Concat, [1]]              # 28: cat(PAN-P3, FPN-P4, Enhanced-P2)
  - [-1, 3, C2f, [512]]                         # 29: P4/16 final (第二次P2注入)

  # Stage 3: P4→P5 融合 (PRN第3次注入)
  - [-1, 1, EGConv, [512, 3, 2]]                # 30: P4→P5 downsample (20×20)
  - [[-1, 10, 23], 1, Concat, [1]]              # 31: cat(PAN-P4, FPN-P5, Enhanced-P2)
  - [-1, 3, C2f, [1024]]                        # 32: P5/32 final (第三次P2注入)

  # ============ Detect Head ============
  - [[19, 26, 29, 32], 1, Detect_DyHead, [nc, 128, 1]]  # 33: Detect (P2, P3, P4, P5)







#Validating runs/train/exp_EGConv_Vis_P2_In/weights/best.pt...
#Ultralytics YOLOv8.2.50 🚀 Python-3.11.10 torch-2.4.0+cu121 CUDA:0 (NVIDIA GeForce RTX 4090, 48646MiB)
#YOLOv81015_P2in summary (fused): 342 layers, 3333244 parameters, 0 gradients, 19.6 GFLOPs
#                 Class     Images  Instances      Box(P          R      mAP50  mAP50-95): 100%|██████████| 28/28 [00:14<00:00,  1.92it/s]
#                   all        548      38759      0.498      0.396      0.408      0.243
#            pedestrian        520       8844      0.545      0.441      0.473      0.224
#                people        482       5125      0.531      0.361      0.384      0.155
#               bicycle        364       1287      0.268      0.178       0.15     0.0682
#                   car        515      14064      0.697      0.811      0.824      0.585
#                   van        421       1975      0.543      0.459      0.464      0.327
#                 truck        266        750      0.471      0.335      0.321      0.211
#              tricycle        337       1045      0.465      0.246      0.268      0.149
#       awning-tricycle        220        532      0.342      0.175      0.171      0.109
#                   bus        131        251      0.536      0.494      0.541      0.377
#                 motor        485       4886       0.58      0.459      0.486      0.224
#Speed: 0.1ms preprocess, 3.8ms inference, 0.0ms loss, 11.5ms postprocess per image
#Results saved to runs/train/exp_EGConv_Vis_P2_In
