# Ultralytics YOLO 🚀, AGPL-3.0 license

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8 backbone with SimFormer at P3 only
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]           # 0-P1/2 (320×320)
  - [-1, 1, EGConv, [128, 3, 2]]     # 1-P2/4 (160×160)
  - [-1, 3, C2f_gConv, [128, True]]     # 2-P2/4 feature
  # SAGE layer removed from P2
  - [-1, 1, EGConv, [256, 3, 2]]     # 3-P3/8 (80×80)
  - [-1, 6, C2f_gConv, [256, True]]     # 4-P3/8 feature
  - [-1, 1, SAGE, [8, 0.7]]        # 5-P3/8 attention

  - [-1, 1, EGConv, [512, 3, 2]]     # 6-P4/16 (40×40)
  - [-1, 6, C2f_gConv, [512, True]]     # 7-P4/16 feature

  - [-1, 1, EGConv, [1024, 3, 2]]    # 8-P5/32 (20×20)
  - [-1, 3, C2f_gConv, [1024, True]]    # 9-P5/32 feature
  - [-1, 1, SPPF, [1024, 5]]            # 10-P5/32 enhanced

# YOLOv8 head
head:
  # FPN 上采样路径
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 11: P5→P4 (40×40)
  - [[-1, 7], 1, Concat, [1]]                   # 12: cat backbone P4
  - [-1, 3, C2f_gConv, [512]]                   # 13: P4/16 fused

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 14: P4→P3 (80×80)
  - [[-1, 5], 1, Concat, [1]]                   # 15: cat backbone P3 (with SimFormer)
  - [-1, 3, C2f_gConv, [256]]                   # 16: P3/8 fused

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 17: P3→P2 (160×160)
  - [[-1, 2], 1, Concat, [1]]                   # 18: cat backbone P2 (no SimFormer)
  - [-1, 3, C2f_gConv, [128]]                   # 19: P2/4 fused

  # PAN 下采样路径
  - [-1, 1, EGConv, [128, 3, 2]]             # 20: P2→P3 (80×80)
  - [[-1, 16], 1, Concat, [1]]                  # 21: cat head P3
  - [-1, 3, C2f_gConv, [256]]                   # 22: P3/8 final

  - [-1, 1, EGConv, [256, 3, 2]]             # 23: P3→P4 (40×40)
  - [[-1, 13], 1, Concat, [1]]                  # 24: cat head P4
  - [-1, 3, C2f_gConv, [512]]                   # 25: P4/16 final

  - [-1, 1, EGConv, [512, 3, 2]]             # 26: P4→P5 (20×20)
  - [[-1, 10], 1, Concat, [1]]                  # 27: cat head P5 (SPPF output)
  - [-1, 3, C2f_gConv, [1024]]                  # 28: P5/32 final

  # Detect head (P2, P3, P4, P5)
  - [[19, 22, 25, 28], 1, Detect_DyHead, [nc, 128, 1]]         # 29: Detect






















