# ============================================================
#  双流 YOLO11  —  P2/P3/P4/P5 四尺度检测
#  基于原版 YOLO11（含 P2 超小目标头），仅做以下改动：
#    1. 增加 IR 并行 Backbone（结构与 RGB 完全相同）
#    2. P3 / P4 / P5 三处用 Concat + C3k2 融合双流特征
#    3. Head 结构与原版 YOLO11 完全一致（层号已更新）
#
#  输入  : 6ch tensor → [RGB(ch 0-2) | IR(ch 3-5)]
#  融合  : 仅用 YOLO11 内置模块（Concat + C3k2），无花哨设计
#
#  仅需两个极简自定义模块（dual_stream_modules.py）：
#    - InputProxy   : 恒等映射（1行代码）
#    - ChannelSplit : 通道切片（1行代码）
#
# 层索引速查：
#   rgb_P2=4  rgb_P3=6  rgb_P4=8  rgb_P5=12
#   ir_P3=18  ir_P4=20  ir_P5=24
#   fused_P3=26  fused_P4=28  fused_P5=30
# ============================================================

nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00,  512]
  l: [1.00, 1.00,  512]
  x: [1.00, 1.50,  512]

ch: 6
# ─────────────────────────────────────────────────────────────
#  BACKBONE
# ─────────────────────────────────────────────────────────────
backbone:

  # ── 输入代理（保存 6ch 供两路引用）─────────────────────────
  - [-1, 1, InputProxy,  []]              # 0 : 恒等, 6ch

  # ── RGB 流 Backbone（原版 YOLO11 结构，逐层对应）───────────
  - [ 0, 1, ChannelSplit, [0, 3]]         # 1 : ch0-2 → RGB 3ch
  - [-1, 1, Conv,  [64,   3, 2]]          # 2 : P1/2
  - [-1, 1, Conv,  [128,  3, 2]]          # 3 : P2/4
  - [-1, 2, C3k2,  [256, False, 0.25]]    # 4 : P2/4  ← rgb_P2（Head P2融合点）
  - [-1, 1, Conv,  [256,  3, 2]]          # 5 : P3/8
  - [-1, 2, C3k2,  [512, False, 0.25]]    # 6 : P3/8  ← rgb_P3
  - [-1, 1, Conv,  [512,  3, 2]]          # 7 : P4/16
  - [-1, 2, C3k2,  [512,  True]]          # 8 : P4/16 ← rgb_P4
  - [-1, 1, Conv,  [1024, 3, 2]]          # 9 : P5/32
  - [-1, 2, C3k2,  [1024, True]]          # 10
  - [-1, 1, SPPF,  [1024, 5]]             # 11
  - [-1, 2, C2PSA, [1024]]                # 12: P5/32 ← rgb_P5

  # ── IR 流 Backbone（结构与 RGB 完全相同，权重独立）─────────
  - [ 0, 1, ChannelSplit, [3, 6]]         # 13: ch3-5 → IR  3ch
  - [-1, 1, Conv,  [64,   3, 2]]          # 14: P1/2
  - [-1, 1, Conv,  [128,  3, 2]]          # 15: P2/4
  - [-1, 2, C3k2,  [256, False, 0.25]]    # 16: P2/4
  - [-1, 1, Conv,  [256,  3, 2]]          # 17: P3/8
  - [-1, 2, C3k2,  [512, False, 0.25]]    # 18: P3/8  ← ir_P3
  - [-1, 1, Conv,  [512,  3, 2]]          # 19: P4/16
  - [-1, 2, C3k2,  [512,  True]]          # 20: P4/16 ← ir_P4
  - [-1, 1, Conv,  [1024, 3, 2]]          # 21: P5/32
  - [-1, 2, C3k2,  [1024, True]]          # 22
  - [-1, 1, SPPF,  [1024, 5]]             # 23
  - [-1, 2, C2PSA, [1024]]                # 24: P5/32 ← ir_P5

  # ── 双流融合（Concat + C3k2，纯 YOLO11 内置模块）───────────
  - [[ 6, 18], 1, Concat, [1]]            # 25: rgb_P3 + ir_P3 → 1024ch
  - [    -1,   2, C3k2, [512, False]]     # 26: fused_P3 (512ch)
  - [[ 8, 20], 1, Concat, [1]]            # 27: rgb_P4 + ir_P4 → 1024ch
  - [-1,   2, C3k2, [512, False]]     # 28: fused_P4 (512ch)
  - [[12, 24], 1, Concat, [1]]            # 29: rgb_P5 + ir_P5 → 2048ch
  - [-1,  2, C3k2, [1024, True]]     # 30: fused_P5 (1024ch)

# ─────────────────────────────────────────────────────────────
#  HEAD — 与原版 YOLO11 P2 头结构完全相同，仅 from 层号更新
#
#  原版对应关系：
#    原 layer10(P5) → 现 layer30(fused_P5)
#    原 layer 6(P4) → 现 layer28(fused_P4)
#    原 layer 4(P3) → 现 layer26(fused_P3)
#    原 layer 1(P2) → 现 layer 4(rgb_P2)  ← P2 无红外对应，用RGB
# ─────────────────────────────────────────────────────────────
head:

  # FPN: P5 → P4
  - [ -1,  1, nn.Upsample, [None, 2, "nearest"]]  # 31
  - [[-1, 28], 1, Concat, [1]]                    # 32: cat fused_P4
  - [ -1,  2, C3k2, [512, False]]            # 33: neck_P4

  # FPN: P4 → P3
  - [ -1,  1, nn.Upsample, [None, 2, "nearest"]]  # 34
  - [[-1, 26], 1, Concat, [1]]                    # 35: cat fused_P3
  - [ -1,  2, C3k2, [256, False]]            # 36: neck_P3  (P3/8-small)

  # FPN: P3 → P2（超小目标头，原版结构保留）
  - [ -1,  1, nn.Upsample, [None, 2, "nearest"]]  # 37
  - [ [-1, 4], 1, Concat, [1]]                    # 38: cat rgb_P2/4
  - [ -1,  2, C3k2, [128, False]]            # 39: neck_P2  (P2/4-extra small)

  # PAN: P2 → P3
  - [ -1,  1, Conv, [128, 3, 2]]             # 40
  - [[-1, 36], 1, Concat, [1]]                    # 41: cat neck_P3
  - [ -1,  2, C3k2, [256, False]]            # 42: pan_P3  (P3/8-small)

  # PAN: P3 → P4
  - [ -1,  1, Conv, [256, 3, 2]]             # 43
  - [[-1, 33], 1, Concat, [1]]                    # 44: cat neck_P4
  - [ -1,  2, C3k2, [512, False]]            # 45: pan_P4  (P4/16-medium)

  # PAN: P4 → P5
  - [ -1,  1, Conv, [512, 3, 2]]             # 46
  - [[-1, 30], 1, Concat, [1]]                    # 47: cat fused_P5
  - [ -1,  2, C3k2, [1024, True]]            # 48: pan_P5  (P5/32-large)

  # Detect: P2(39) · P3(42) · P4(45) · P5(48)
  - [[39, 42, 45, 48], 1, Detect, [nc]]               # 49